jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
    File file = fs.open(path, FILE_APPEND, true);
    file.println(message);
    /*
    if(!file){
      Serial.println("Failed to open file for appending");
      return;
    }
    if(file.print(message)){
        Serial.println("Message appended");
    } else {
      Serial.println("Append failed");
    }
    */
    file.close();
}

void readFile(fs::FS &fs, const char *path)
{
    StaticJsonDocument<2048> doc;

    File file = fs.open(path);
    if (!file)
    {
        //Serial.println("Failed to open file for reading");
        File fileR = fs.open(path, FILE_APPEND, true);
        file.println("CREATE FILE");
        //if(!fileR)Serial.println("File not create");
        file.close();
        return;
    }

    while (file.available())
    {
        String lineJson = file.readStringUntil('\n');
        DeserializationError error = deserializeJson(doc, lineJson);

        if (error) {
            //Serial.print(F("deserializeJson() failed: "));
            //Serial.println(error.f_str());
            return;
        }

        const char* ldt = doc["dt"];
        String t_ldt = s.separa(String(ldt),' ',1);
        dtFillPumpList.push(s.separa(t_ldt,':',0).toFloat() + s.separa(t_ldt,':',1).toFloat() / 60.00);
        FillPumpList.push(doc["f"]);

        if(doc["status"] == "running") runTime += runTimeFactor; 
        
        nRecords++;
        // Serial.write(file.read());
    }
    file.close();
    //Serial.println("records: " + String(nRecords));
}

/* ====================== Callback ======================== */
void mqttCallback(char *topic, byte *payload, unsigned int length)
{
  if (String(topic) == String(topicSubscribe) + String(WellName) + "/config")
  {
    String msg_in = "";
    for (int i = 0; i < length; i++)
    {
      msg_in += String((char)payload[i]);
    }
    TIME_TO_SLEEP = msg_in.toInt();
  }
}
/* ************************* SETUP WIFI ************************** 
void setup_wifi()
{
    WiFi.begin(ssid, password);
    delay(100);
    int count = 0;
    while (WiFi.status() != WL_CONNECTED)
    {
        //Serial.print(ssid);
        delay(5000);
        if (count == 3)
        {
            ESP.restart();
        }
        count++;
    }

    delay(2000);
}
*/

/* ******************* RECONNECT  ********************** */
boolean mqttConnect(){
  boolean status = mqtt.connect(mqtt_id, mqtt_user, mqtt_pass);

  if (status == false){
    ESP.restart();
    return false;
  }
  String topicS = topicSubscribe + WellName + "/#";
  mqtt.subscribe(topicS.c_str());

  return mqtt.connected();
}

void reconnect()
{
  int count = 0;
  while (!mqtt.connected())
  {
    uint32_t t = millis();
    if (t - lastReconnectAttempt > 10000L) {
      lastReconnectAttempt = t;
      if (mqttConnect()) {
        lastReconnectAttempt = 0;
      }
    }
  }
}

/* ============================== SETUP GRPS ============================== */
boolean setup_grps()
{
  // Set GSM module baud rate and UART pins
  SerialAT.begin(115200, SERIAL_8N1, MODEM_RX, MODEM_TX);
  delay(3000);

  modem.restart();

  String modemInfo = modem.getModemInfo();
  //Serial.println(modemInfo);

  if (modemInfo == "")
  {
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 255}}));
    return false;
  }
  /* */
  if (!modem.waitForNetwork(240000L))
  {
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 255}}));
    delay(1000);
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 0}}));
    delay(1000);
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 255}}));
    return false;
  }
  
  if (modem.isNetworkConnected())
  {
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 255, .red = 0}}));
  }
  else
  {
    return false;
  }

  if (!modem.gprsConnect(apn))
  //if (!modem.gprsConnect(apn, gprsUser, gprsPass))
  {
    //Serial.println("grps fail");
    return false;
  }
  else
  {
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 255, .red = 0}}));
    delay(1000);
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 0}}));
    delay(1000);
    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 255, .red = 0}}));
    //Serial.println("grps ok"); // sim  grps ok
    return true;
  }
}

/* ====================================================================================== */
/* ============================== NEURAL NETWORKS FUNTIONS ============================== */
/* ====================================================================================== */
float relu(float n)
{
    if (n >= 0)
        return n;
    else if (n < 0)
        return 0;
}

float sigmoid(float n)
{
    return 1.0 / (1.0 + exp(-n));
}

/* ============================== MAP FUNCTION ============================== */
float mapfloat(long x, long in_min, long in_max, long out_min, long out_max)
{
    return (float)(x - in_min) * (out_max - out_min) / (float)(in_max - in_min) + out_min;
}

/* ============================== NEURAL NETWORK FOR DIAGNOSIS ============================== */
void diagnosis()
{
    /* NN variables */
    // float a0[50];

    float W1[15][50] = {{-0.665, -0.618, -0.007, 0.067, -0.158, -0.053, 0.093, 0.248, -0.03, 0.53, 0.254, -0.104, 0.244, 0.254, 0.487, 0.121, 0.479, 0.383, 0.409, 0.185, 0.587, 0.493, 0.282, -0.13, 0.322, 0.386, 0.371, -0.194, -0.373, -0.686, -0.351, -0.127, 0.278, 0.047, 0.287, 0.349, -0.013, 0.169, 0.394, 1.148, 1.182, 1.415, 0.364, -0.439, -0.717, -0.295, -0.351, 0.387, 1.054, 0.735}, {-0.608, -0.306, -0.135, 0.904, -0.184, -0.358, -0.417, -0.97, -0.074, 0.055, 0.432, 0.411, 0.099, 0.081, -0.035, 0.097, 0.162, -0.178, -0.079, 0.41, -0.21, 0.264, 0.556, 0.006, 0.233, -0.247, -0.171, 0.04, 0.903, 0.85, 0.068, -0.403, 0.114, 0.286, 0.065, -0.341, -0.528, -0.35, -0.126, -0.465, -1.132, -0.642, -0.528, 0.556, 1.327, 1.251, 0.288, -0.056, -1.015, -1.187}, {-0.161, 0.119, 0.09, 0.041, -0.248, -0.068, -0.298, 0.14, 0.03, 0.261, 0.364, -0.122, 0.232, 0.581, 0.199, 0.026, 0.551, 0.142, -0.021, 0.004, 0.164, -0.04, 0.582, 0.27, 0.173, 0.461, 0.113, -0.328, -0.501, -0.348, -0.389, -0.238, -0.045, 0.011, 0.177, -0.522, -0.089, -0.074, 0.097, -0.019, -0.575, -0.155, 0.001, -0.013, 0.815, 0.426, 0.194, -0.454, -1.346, -0.838}, {-1.106, -0.07, -0.403, -0.232, 0.187, -0.006, 0.302, 0.005, 0.202, 0.012, 0.168, 0.229, 0.077, 0.04, 0.399, 0.246, 0.324, 0.208, 0.457, 0.424, 0.013, 0.052, 0.05, -0.179, 0.01, -0.019, 0.273, 0.094, -0.592, -0.081, 0.03, -0.302, -0.038, -0.162, -0.462, 0.193, -0.474, 0.035, -0.152, 0.016, 0.542, 0.348, 0.002, -0.012, -1.171, -0.781, -0.247, 0.363, 1.231, 0.58}, {-0.099, 0.424, -0.204, -0.457, 0.067, 0.523, 0.354, 0.326, 0.336, 0.412, 0.424, 0.198, -0.055, 0.548, 0.08, 0.541, 0.208, 0.184, 0.239, -0.16, 0.149, 0.137, 0.049, -0.398, 0.081, -0.39, 0.138, 0.218, 0.471, -0.03, 0.192, -0.079, -0.003, -0.116, -0.015, 0.002, 0.118, 0.059, 0.18, 0.245, 0.473, 0.541, 0.713, 1.017, 0.959, -0.275, 0.16, -0.946, -0.818, -1.245}, {0.665, -0.154, 0.335, -0.077, 0.312, 0.288, -0.026, -0.331, 0.242, 0.21, 0.065, 0.115, -0.092, -0.119, -0.039, 0.305, -0.178, 0.033, -0.23, -0.179, 0.326, 0.06, 0.062, -0.088, 0.339, 0.236, -0.006, -0.039, 0.684, 0.246, 0.821, 0.308, -0.289, 0.574, 0.268, 0.567, 0.497, 0.299, -0.343, -0.527, 0.187, -0.194, -0.894, -0.967, -0.715, -0.031, -0.071, 1.115, 1.272, 1.472}, {-0.376, 0.569, -0.434, -0.512, -0.361, 0.228, 0.178, 0.487, 0.134, 0.228, 0.274, 0.412, -0.143, 0.258, -0.055, 0.175, 0.203, 0.315, 0.022, 0.187, -0.273, -0.04, 0.194, -0.214, 0.124, 0.081, 0.343, -0.328, -0.106, -0.119, -0.221, 0.163, -0.381, 0.126, 0.044, 0.191, 0.015, 0.085, 0.173, 0.765, 1.548, 1.05, 1.327, 0.479, -0.455, -0.363, 0.251, -1.001, -0.574, -0.88}, {-1.49, -0.317, 0.072, -0.132, -0.327, -0.498, 0.465, -0.094, 0.111, -0.101, -0.297, -0.356, 0.41, 0.193, 0.163, -0.14, 0.196, 0.153, 0.353, 0.094, 0.519, 0.246, -0.038, 0.202, -0.495, -0.231, 0.06, -0.993, -1.315, -1.028, -0.056, 0.476, 0.259, 0.356, -0.291, 0.372, 0.203, 0.485, 0.219, -0.217, 0.038, 0.247, 0.008, -0.199, -1.054, -1.005, -0.852, 0.083, 0.888, -0.265}, {0.019, 0.175, -0.157, 0.39, -0.124, -0.465, -0.32, -0.447, -0.219, -0.341, 0.268, -0.174, 0.191, -0.207, 0.128, 0.231, -0.202, 0.107, -0.119, -0.058, -0.198, -0.216, 0.124, -0.234, -0.174, -0.223, 0.271, 0.352, 0.053, 0.795, 0.448, 0.886, 0.243, 0.727, 0.685, 0.246, 1.007, 0.608, 0.758, 0.204, -0.21, -0.165, -0.086, 0.674, 0.571, 0.132, 0.135, -0.443, -0.6, -0.135}, {-0.251, -0.131, 0.622, 0.841, 0.299, -0.152, -0.378, -0.508, -0.296, -0.948, -0.869, -0.444, -0.118, 0.164, 0.114, -0.175, 0.01, 0.434, 0.59, 0.299, 0.447, 0.237, 0.358, 0.341, 0.204, -0.272, -0.008, 0.064, -0.018, 0.901, 0.841, -0.63, -1.338, -1.959, -2.413, -1.12, -0.051, -0.602, -0.381, -0.356, -0.599, -0.633, -0.834, -0.268, -0.378, -0.567, -0.476, 0.273, 1.39, 0.406}, {0.842, 0.412, 0.227, 0.073, 0.205, 0.241, -0.053, -0.255, -0.395, -0.381, 0.235, -0.289, 0.144, -0.196, -0.222, -0.312, 0.167, 0.271, 0.421, -0.184, 0.133, 0.25, -0.256, 0.142, 0.104, -0.13, 0.391, 0.051, 0.558, 0.705, 0.457, 0.473, -0.324, -0.344, -0.157, -0.174, -0.171, -0.15, -0.554, -0.287, 1.529, 1.104, 0.711, 0.673, -0.374, -0.242, -0.654, 0.466, 1.359, 0.617}, {0.76, -0.249, -0.12, 0.419, -0.025, -0.579, 0.216, -0.212, -0.156, -0.015, -0.05, 0.432, -0.238, 0.183, 0.242, -0.021, -0.002, 0.113, 0.201, 0.023, 0.014, 0.169, 0.312, 0.247, -0.056, 0.135, -0.004, 0.007, 0.574, 0.462, 0.286, 0.277, 0.246, 0.499, 0.61, 0.159, 0.22, 0.04, 0.633, 0.292, -0.395, -0.425, -0.607, -0.717, -0.421, -0.716, -0.603, -0.137, 0.862, 1.008}, {0.156, -0.01, -0.296, -0.013, -0.412, 0.174, 0.019, -0.371, 0.118, -0.01, 0.129, -0.416, -0.297, 0.128, -0.025, -0.422, -0.358, 0.213, 0.176, 0.032, 0.234, 0.284, 0.217, 0.375, -0.101, 0.082, -0.371, 0.102, 0.135, 0.04, -0.18, -0.081, -0.009, -0.345, 0.051, -0.058, 0.091, -0.182, -0.259, -0.048, -0.189, 0.131, -0.177, 0.053, -0.126, 0.121, 0.067, 0.019, -0.08, -0.152}, {0.042, -0.553, 0.368, 0.632, 0.541, 0.065, -0.24, -0.089, 0.134, 0.08, -0.364, 0.041, 0.11, -0.352, 0.02, 0.124, -0.137, -0.399, 0.035, 0.054, -0.186, 0.49, 0.605, 0.298, 0.721, 0.473, 0.402, 0.098, 0.303, 0.399, 0.108, 0.453, 0.194, 0.009, -0.08, -0.345, -0.38, -0.237, -0.267, -0.543, -0.719, -0.893, -1.63, -1.652, -0.649, 0.441, -0.36, 1.206, 1.622, 1.762}, {0.276, 0.229, 0.282, 0.318, 0.624, 0.082, 0.139, 0.738, 0.54, 0.436, 0.222, -0.348, -0.196, -0.578, -0.321, -0.679, -0.849, -0.486, -0.609, -0.414, -0.6, -0.412, -0.091, -0.173, -0.5, -0.068, 0.588, 0.076, -0.036, 0.19, 0.422, -0.528, -0.64, -0.169, -0.525, -0.367, -0.743, -0.622, -1.089, -0.833, -0.428, -0.571, -1.231, -0.996, -0.87, -0.001, -0.338, 0.365, -0.065, -0.847}};
    float a1[15];
    float W2[10][15] = {{0.449, -0.577, 0.694, 0.656, 0.033, -0.58, 0.186, 1.735, -1.684, -0.556, 0.025, -0.383, -0.32, -0.083, -1.59}, {-0.302, -0.243, 0.178, -0.058, -0.114, -0.449, -0.694, -0.476, -0.133, -1.245, 0.086, -0.016, 0.328, -0.619, -0.55}, {-0.098, -0.659, -0.546, 0.197, -0.542, -0.132, 0.162, -0.605, 0.057, -0.198, -0.112, -0.154, 0.181, -0.378, -0.906}, {-0.335, -0.843, -0.127, -0.428, -0.488, -0.526, -0.403, -0.931, -0.118, -0.677, -0.528, -0.578, -0.271, -0.086, -0.51}, {-0.771, 0.376, -0.637, 0.189, 0.041, -0.028, -1.285, -1.278, 0.182, 1.208, 1.067, -0.006, -0.191, 0.33, -2.253}, {-0.163, 0.651, 0.659, -1.294, -0.723, -0.077, -1.053, 0.193, 0.533, -1.554, -2.058, 0.638, -0.228, 0.504, -2.301}, {-0.334, -1.489, -0.617, -0.171, 0.784, -0.246, 0.459, 0.464, 0.225, -0.684, 1.395, 0.267, -0.177, -1.121, -0.885}, {-1.241, 0.576, 0.528, -0.097, -0.006, -0.269, 0.314, -2.552, 0.656, -0.08, 0.09, -0.591, 0.262, -0.355, -0.27}, {0.079, -0.198, 0.227, -0.641, -0.164, 0.189, -0.477, -1.408, -1.596, -1.651, -0.321, -0.276, 0.27, 0.241, 0.973}, {-0.275, 1.414, 0.865, -0.927, 0.75, -0.976, 0.175, -0.888, 0.203, -0.892, -1.281, -0.286, -0.256, -1.092, -1.81}};
    float a2[10];
    float b1[15] = {-0.239, 1.094, 0.358, -0.568, 0.015, 0.238, -0.145, 1.516, 1.057, 1.409, -0.233, 0.156, -0.067, 0.319, 1.625};
    float b2[10] = {-0.478, -0.21, -0.207, -0.259, -0.115, 0.281, -0.565, 0.024, -0.101, 0.437};
    float aux = 0.0;


    /* ***** Neural network running ***** */
    for (int i = 0; i < 15; i++)
    {
        aux = 0.0;
        for (int j = 0; j < 50; j++)
        {
            aux = aux + W1[i][j] * a0[j];
        }
        a1[i] = relu(aux + b1[i]);
    }
    for (int i = 0; i < 10; i++)
    {
        aux = 0.0;
        for (int j = 0; j < 15; j++)
        {
            aux = aux + W2[i][j] * a1[j];
        }
        a2[i] = sigmoid(aux + b2[i]);
    }

    for (int i = 0; i < 10; i++)
    {
        v_diagnosis[i] = a2[i];
    }
}

