jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
/* ============================== NEURAL NETWORK FOR FILL PUMP ============================== */
void fillPump()
{
    /* NN variables */
    float W1[15][50] = {{0.097, 0.204, 0.412, -0.062, -0.456, -0.222, 0.209, 0.255, -0.414, 0.323, -0.205, 0.131, -0.173, -0.375, -0.199, 0.027, 0.391, 0.483, 0.255, 0.312, 0.443, -0.063, -0.112, -0.08, 0.428, -0.233, -0.198, -0.003, -0.222, 0.045, 0.022, 0.185, -0.076, -0.278, -0.141, 0.009, -0.05, 0.215, -0.181, 0.283, -0.367, 0.176, 0.255, -0.121, 0.032, -0.126, -0.189, -0.141, -0.373, -0.232}, {0.522, 0.634, 0.116, 0.806, 0.089, -0.024, 0.126, -0.389, -0.217, -0.427, 0.047, -0.259, -0.679, -0.07, -0.766, -0.605, -0.447, -0.363, -0.556, -0.416, -0.672, -0.654, -0.696, -0.655, -0.606, -0.544, -0.095, -0.396, -0.645, -0.029, -0.487, -0.411, -0.393, -0.461, -0.721, -0.481, -0.446, -0.566, -0.423, 0.132, 0.342, -0.487, -0.291, -0.412, -0.327, -0.588, -0.296, -0.545, -0.192, -0.191}, {-0.356, -0.036, 0.466, -0.358, 0.087, -0.077, -0.067, 0.208, 0.03, 0.042, -0.114, 0.113, -0.248, -0.028, 0.089, 0.079, 0.25, -0.081, 0.192, 0.339, 0.226, 0.413, -0.183, 0.021, 0.269, 0.284, 0.115, -0.342, -0.006, -0.071, -0.134, -0.117, -0.096, 0.302, -0.377, -0.443, 0.094, 0.14, -0.191, -0.083, -0.16, -0.103, -0.57, -0.179, -0.229, 0.298, -0.285, 0.286, -0.185, 0.065}, {-0.457, -0.061, -0.258, -0.065, -0.096, -0.055, 0.217, -0.17, -0.278, 0.133, 0.037, -0.418, -0.21, 0.065, -0.16, 0.451, 0.238, 0.15, 0.493, 0.087, 0.324, 0.096, -0.283, 0.434, 0.123, 0.046, 0.419, 0.248, -0.002, -0.008, -0.075, -0.138, 0.372, 0.004, -0.144, -0.099, -0.038, 0.181, -0.044, -0.069, -0.449, 0.032, -0.04, -0.005, -0.299, 0.294, -0.203, 0.236, -0.127, 0.278}, {0.135, 0.32, 0.001, 0.341, 0.136, -0.047, -0.011, 0.172, -0.042, 0.036, 0.092, -0.053, 0.291, -0.4, -0.038, 0.068, 0.142, -0.214, -0.12, -0.068, 0.119, 0.263, -0.032, 0.17, -0.079, -0.059, 0.285, -0.013, 0.2, 0.424, 0.061, 0.231, -0.142, -0.085, -0.334, -0.033, -0.037, 0.321, 0.287, 0.182, -0.071, 0.428, 0.045, 0.054, -0.037, -0.187, 0.011, -0.447, 0.162, -0.15}, {-0.031, 0.367, 0.597, -0.237, 0.245, -0.037, -0.2, -0.556, -0.291, -0.511, -0.138, 0.528, 0.285, 0.314, -0.072, 0.14, -0.055, 0.095, 0.302, -0.209, 0.226, 0.159, -0.026, 0.387, -0.121, -0.089, -0.035, -0.006, -0.643, -0.238, -0.486, -0.069, -0.534, -0.497, -0.948, -0.214, -0.031, -0.061, -0.227, 0.051, -0.66, 0.575, 0.42, 0.402, 0.17, -0.03, 0.122, -0.659, -0.381, -0.537}, {0.027, 0.058, -0.128, 0.036, 0.083, -0.055, -0.341, 0.027, 0.078, 0.066, 0.091, 0.047, -0.071, 0.015, -0.219, -0.147, -0.151, 0.007, -0.164, 0.016, 0.117, -0.066, -0.161, -0.27, -0.337, -0.342, 0.152, 0.049, 0.149, 0.049, 0.156, -0.454, 0.133, 0.058, -0.291, 0.203, 0.198, 0.122, -0.065, 0.122, 0.02, 0.063, 0.179, 0.155, 0.245, 0.14, 0.297, 0.233, 0.233, 0.106}, {-0.244, 0.3, -0.37, 0.084, -0.021, -0.229, 0.021, 0.007, -0.519, -0.195, 0.313, 0.299, 0.328, -0.118, 0.253, -0.034, -0.007, -0.194, 0.051, 0.325, -0.057, -0.066, 0.307, -0.011, 0.219, -0.141, -0.317, 0.142, -0.031, -0.081, 0.155, -0.018, 0.116, 0.207, 0.007, -0.012, -0.019, 0.146, -0.152, 0.203, -0.072, -0.02, 0.143, -0.139, -0.121, -0.358, 0.25, -0.039, -0.242, -0.42}, {-0.128, -0.116, 0.103, -0.143, -0.412, 0.263, 0.267, -0.043, 0.313, 0.026, -0.439, -0.027, -0.081, 0.301, 0.067, -0.002, 0.068, 0.212, 0.007, 0.06, 0.326, 0.361, -0.17, 0.136, 0.04, -0.288, -0.415, 0.05, 0.041, -0.057, -0.142, 0.172, 0.312, -0.128, -0.268, -0.251, 0.17, 0.143, -0.081, 0.083, 0.206, 0.222, 0.07, -0.128, -0.118, -0.163, -0.593, 0.063, -0.145, 0.155}, {0.196, 0.221, 0.552, 0.673, 0.314, 0.128, -0.232, 0.049, -0.629, 0.094, -0.673, -0.677, -0.586, -0.722, -0.392, -0.3, -0.17, -0.45, -0.282, -0.426, -0.67, -0.056, -0.679, -0.503, -0.396, -0.572, -0.555, -0.347, -0.736, -0.331, -0.409, -0.766, -0.333, -0.513, -0.188, -0.24, -0.485, -0.286, 0.094, -0.057, 0.825, -0.187, -0.099, -0.739, -0.502, -0.27, -0.211, -0.547, -0.205, 0.001}, {0.03, -0.052, 0.152, -0.052, 0.034, 0.021, -0.219, -0.116, 0.141, -0.282, 0.155, 0.089, -0.235, 0.135, 0.367, -0.05, -0.235, -0.022, -0.22, -0.422, 0.067, 0.148, -0.143, 0.258, 0.022, -0.061, 0.287, -0.05, -0.114, -0.307, -0.413, -0.243, 0.044, 0.194, 0.382, 0.24, 0.015, 0.105, -0.112, -0.025, -0.127, 0.073, 0.219, 0.112, 0.071, 0.13, 0.192, 0.182, 0.345, -0.218}, {0.143, -0.476, -0.059, -0.202, 0.041, -0.071, 0.253, 0.041, 0.073, -0.06, 0.134, -0.264, -0.098, -0.163, 0.055, -0.199, 0.172, -0.045, -0.082, 0.398, -0.029, 0.064, -0.297, -0.161, -0.21, -0.128, 0.326, 0.017, 0.035, 0.13, 0.077, -0.333, -0.146, 0.002, -0.125, 0.084, 0.298, -0.145, 0.204, -0.04, 0.066, 0.232, -0.116, 0.05, -0.121, 0.473, -0.02, 0.082, 0.333, -0.004}, {0.237, -0.039, -0.231, -0.147, -0.051, -0.466, 0.184, -0.323, -0.241, 0.021, -0.064, -0.13, -0.091, 0.003, -0.4, 0.227, 0.329, 0.064, 0.116, 0.14, -0.19, 0.253, 0.086, -0.228, -0.318, 0.226, 0.003, -0.376, 0.182, 0.128, -0.045, 0.007, 0.263, 0.123, -0.133, -0.013, 0.13, 0.045, 0.219, 0.285, -0.285, -0.346, -0.003, -0.365, 0.126, 0.129, -0.213, 0.206, 0.229, 0.257}, {0.243, 0.099, 0.237, 0.053, 0.028, -0.274, -0.35, -0.087, -0.358, -0.111, 0.02, -0.185, -0.11, 0.185, -0.037, 0.194, 0.379, -0.416, 0.16, 0.212, 0.216, -0.144, 0.29, 0.021, -0.104, 0.23, 0.022, 0.389, -0.027, -0.007, 0.058, 0.098, -0.178, 0.42, -0.123, 0.108, 0.113, -0.084, 0.22, -0.071, 0.306, 0.151, -0.094, -0.094, -0.424, 0.145, 0.309, -0.603, -0.294, -0.068}, {0.37, -0.2, -0.218, 0.217, -0.273, 0.117, 0.497, -0.172, 0.239, -0.383, 0.446, -0.301, 0.109, -0.277, 0.341, 0.378, 0.016, -0.24, 0.454, 0.254, 0.056, -0.203, -0.057, 0.162, -0.066, -0.133, 0.181, 0.228, 0.027, 0.158, -0.166, -0.239, -0.488, 0.131, -0.424, -0.219, 0.029, 0.217, 0.006, -0.558, -0.268, -0.185, -0.418, 0.195, 0.735, 0.195, -0.396, 0.407, 0.192, 0.152}};
    float a1[15];
    float W2[1][15] = {{0.658, -0.49, 0.355, 0.354, -0.63, 1.43, 0.426, -0.358, 0.223, -0.519, 0.48, 0.492, 0.239, -0.472, 0.535}};
    float a2[1];
    float b1[15] = {-0.149, 0.324, 0.003, -0.169, 0.222, 1.139, -0.117, 0.123, -0.23, 0.365, -0.019, -0.05, -0.048, 0.211, 0.114};
    float b2[1] = {-0.215};
    float aux = 0.0;

    /* ***** Neural network running ***** */
    for (int i = 0; i < 15; i++)
    {
        aux = 0.0;
        for (int j = 0; j < 50; j++)
        {
            aux = aux + W1[i][j] * a0[j];
        }
        a1[i] = relu(aux + b1[i]);
    }
    for (int i = 0; i < 1; i++)
    {
        aux = 0.0;
        for (int j = 0; j < 15; j++)
        {
            aux = aux + W2[i][j] * a1[j];
        }
        a2[i] = sigmoid(aux + b2[i]);
    }

    fill = a2[0];
}

/* ********************** MAIN PROCCESS *********************** */
void AcquisitionScreen_0(int16_t numberData, int16_t numberDataFill);
void dataProcess(){
/* ----------------- Preprocessing service ----------------- */
    float maxAcc = 0;
    float minAcc = 0;
    float maxLoad = 0;
    float minLoad = 0;

    int max_acc_index = 0;
    int min_acc_index = 0;
    int max_load_index = 0;
    int min_load_index = 0;

    maxAcc = acc_raw.maximum(&max_acc_index);
    minAcc = acc_raw.minimum(&min_acc_index);
    maxLoad = load_raw.maximum(&max_load_index);
    minLoad = load_raw.minimum(&min_load_index);

      /* ************ Detect pump stopped service ************ */
    if ((maxAcc - minAcc) <= 30)
    {
        status = "stopped";
        for(int8_t i = 0; i < 50; i++){
            pp[i] = 0;
        }
    }else
    {
        /* ************ Separe stroke ************ */
        status = "running";

        float value;
        int16_t i_start = 0;
        int16_t i_flag = 0;
        int16_t i_end = 0;
        float tp = 0;
        float diff;
        float range = maxAcc - minAcc;

        for (int16_t i = 0; i < read_n_max - 1; i++)
        {
            value = acc_raw.get(i);
            diff = value - minAcc;
            if (diff > 0.8 * range && i_flag == 0 && i_end == 0)
            {
                if (diff > tp)
                {
                    tp = diff;
                    i_start = i;
                }
            }
            else if (i_start != 0 && diff < 0.2 * range && i_end == 0)
            {
                if (diff < tp)
                {
                    tp = diff;
                    i_flag = i;
                }
            }
            else if (i_flag != 0 && diff > 0.8 * range)
            {
                if (diff > tp)
                {
                    tp = diff;
                    i_end = i;
                }
            }
            else if (diff < 0.2 * range && i_end != 0)
            {
                break;
            }
        }

        /* ************ detect stroke integrity ************ */
        if (i_start == 0 || i_end == 0)
        {
            logging = "Incomplete dynachart";
            return;
        }

