jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
        // ======== get min and peak ========        
        PeakLoad = String(maxLoad,2);
        MinLoad = String(minLoad,2);
        SPM = String(60000.00/(25.00*(i_end - i_start)),2);

        // ======== TRACE STROKE ========        
        load_ser->y_points[i_start + 1] = 1050;
        load_ser->y_points[i_end + 1] = 1050;

        pos_ser->y_points[i_start + 1] = 2450;
        pos_ser->y_points[i_end + 1] = 2450;

        lv_chart_refresh(loadChart);
        lv_chart_refresh(posChart);

        lv_timer_handler();
        lv_timer_handler();

        /* ************ resize array to 50 ************ */
        float length = float(i_end - i_start) / 49.00;

        float temp;
        int index;
        for (int i = 0; i < 49; i++)
        {
            index = i_start + i * length;
            temp = mapfloat(load_raw.get(index),990.00,8000.00,0.00,2500.00);
            load.push(temp);

            temp = mapfloat(acc_raw.get(index),2400.00,2550.00,0.00,200.00);
            pos.push(temp);
            //pos.push(acc_raw.get(index)-240.00);
        }

        temp = mapfloat(load_raw.get(i_end), 990.00, 8000.00, 0.00,2500.00);
        load.push(temp);
        
        temp = mapfloat(acc_raw.get(i_end),2400.00,2550.00,0.00,200.00);
        //pos.push(acc_raw.get(index)-240.00);
        pos.push(temp);
        
        // a0[49] = temp;

        if (abs(maxLoad - minLoad) <= 3){
            v_diagnosis[10] = 1;
            fill = 0;
        }else{
            /* ************ NN for diagnosis ************ */
            diagnosis();

            /* ************ NN for fillpump ************ */
            fillPump();
        }
        
    }

    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 0}}));
    delay(5000);

    AcquisitionScreen_0(50, nRecords);
    lv_timer_handler();
    lv_timer_handler();
}

/* ********************** SEND MESSAGE *********************** */
void saveSendDate(String t_dt)
{
    payload = "";
    StaticJsonDocument<2048> doc;
    doc["well"] = WellName;
    doc["status"] = status;
    doc["dt"] = dt;
    if (status == "stopped")
    {
        doc["f"] = 0;
        doc["SPM"] = 0;
    }else if(logging == "Incomplete dynachart"){
        doc["log"] = logging;
    }
    else{
        if(v_diagnosis[10] == 1){ /// rods broken
            JsonArray diag = doc.createNestedArray("diag");
            diag.add(10);
            doc["f"] = 0;
        }else{
            doc["f"] = serialized(String(fill, 2));
            JsonArray diag = doc.createNestedArray("diag");
            for (int8_t i = 0; i < 11; i++)
            {
                if (v_diagnosis[i] > 0.8) // tresholder 0.7
                {
                    diag.add(i);
                }
            }
        }
        
        JsonArray p = doc.createNestedArray("p");
        JsonArray l = doc.createNestedArray("l");

        for (int i = 0; i < 50; i++)
        {
            p.add((float)((int)round(pos.get(i))) * 0.01);
            l.add((float)((int)round(load.get(i))) * 0.01);
        }
    }

    serializeJson(doc, payload);
    appendFile(SD, t_dt.c_str(), payload.c_str());

    delay(50);
    String acc_r = "";
    float ta;
    for (int i = 0; i < read_n_max; i++){
        ta = mapfloat(acc_raw.get(i),2400.00,2550.00,0.00,200.00);
        acc_r += String(ta*0.01,2) + ",";
    }
    appendFile(SD, t_dt.c_str(), acc_r.c_str());

    if (transmission_mode)
    {
        pcf8574.digitalWrite(P2, HIGH); // 
        delay(1000);

        setup_grps();
        mqtt.setServer(broker, mqtt_port);
        mqtt.setCallback(mqttCallback);
        reconnect();
        mqtt.publish(topicPublish, payload.c_str());
        delay(500);
        modem.sleepEnable(true);
        pcf8574.digitalWrite(P2, LOW);
        gpio_deep_sleep_hold_en();
    }

    //Serial.println(payload);
    delay(10000);
    esp_deep_sleep_start();
}

/* ************************* ADD DATA FUNCTION FOR ACQUISITION ************************** */
static void add_data(lv_timer_t *timer)
{
    LV_UNUSED(timer);
    static uint32_t cnt = 0;

    filter_value_pos = (alpha_p * ADS.readADC(0) * f) + ((1 - alpha_p) * filter_value_pos);
    filter_value_load = (alpha_l * (ADS.readADC(1)* f)) + ((1 - alpha_l) * filter_value_load);
    acc_raw.push(filter_value_pos * 10);
    load_raw.push(filter_value_load * 10);
    
    if (cnt % 5 == 0)
    {
        
        Pos = String(acc_raw.get(cnt),1);
        lv_label_set_text(label_box_pos, Pos.c_str());

        Load = String(load_raw.get(cnt),1);
        lv_label_set_text(label_box_load, Load.c_str());
    }
    lv_chart_set_next_value(posChart, pos_ser, acc_raw.get(cnt));
    lv_chart_set_next_value(loadChart, load_ser, load_raw.get(cnt));

    cnt++;
}

static void add_data_ESPNOW(lv_timer_t *timer)
{
    LV_UNUSED(timer);
    static uint32_t cnt = 0;

    if(flag == 0){
        //Serial.println(dt);
        lv_label_set_text(DateTime_label, dt.c_str());

    }else if(flag == 1){
        acc_raw.push(tmp_acc);
        load_raw.push(tmp_load);

       //Serial.println(String(cnt) + " -- " + String(acc_raw.get(cnt)));

        if (cnt % 5 == 0)
        {
            Pos = String(tmp_acc,1);
            lv_label_set_text(label_box_pos, Pos.c_str());

            Load = String(tmp_load,1);
            lv_label_set_text(label_box_load, Load.c_str());
        }
        lv_chart_set_next_value(posChart, pos_ser, tmp_acc*1);
        lv_chart_set_next_value(loadChart, load_ser, tmp_load*1);
        
        cnt++;
    }else if(flag == 2){
        
    }
    
}

/* ************************* ACQUISITION SCREEN ************************ */
void AcquisitionScreen(int16_t numberData, int16_t numberDataFill)
{
    // Clear screen
    lv_obj_clean(lv_scr_act());

    // Create Header
    static lv_style_t style_shadow;
    auto Header = lv_obj_create(lv_scr_act());
    lv_obj_add_style(Header, &style_shadow, 0);
    lv_obj_set_pos(Header, 1, 1);
    lv_obj_set_size(Header, 318, 30);

    // Set label to WellName
    auto WellName_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(WellName_label, 7, 5);
    lv_obj_set_style_text_color(WellName_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(WellName_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(WellName_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);
    lv_label_set_text(WellName_label, WellName.c_str());

    // Set label to DateTime
    DateTime_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(DateTime_label, 90, 5);
    lv_obj_set_style_text_color(DateTime_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(DateTime_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(DateTime_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);
    lv_label_set_text(DateTime_label, dt.c_str());

    // ***************** Set label to message *****************
    Acquisition_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(Acquisition_label, 10, 32);
    lv_obj_set_style_text_color(Acquisition_label, lv_palette_main(LV_PALETTE_DEEP_PURPLE), LV_STATE_DEFAULT);
    lv_label_set_long_mode(Acquisition_label, LV_LABEL_LONG_SCROLL_CIRCULAR); /*Circular scroll*/
    lv_obj_set_width(Acquisition_label, 300);
    lv_obj_set_style_text_font(Acquisition_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);
    lv_label_set_text(Acquisition_label, "Acquiring data");
    
    // Create spam load label
    auto span_load_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(span_load_label, 5, 80);
    lv_obj_set_style_text_color(span_load_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(span_load_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(span_load_label, &lv_font_montserrat_14, LV_STATE_DEFAULT);
    lv_label_set_text(span_load_label,"Load (mV): ");

    // Create BOX to load value
    auto back_box_load = lv_obj_create(lv_scr_act());
    lv_obj_add_style(back_box_load, &style_shadow, 0);
    lv_obj_set_pos(back_box_load, 95, 70);
    lv_obj_set_size(back_box_load, 110, 30);

    label_box_load = lv_label_create(lv_scr_act());
    lv_obj_set_pos(label_box_load, 100, 73);
    lv_obj_set_style_text_color(label_box_load, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(label_box_load, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(label_box_load, &lv_font_montserrat_22, LV_STATE_DEFAULT);
    lv_label_set_text(label_box_load,"--");

    // ***************** Create chart load *****************
    loadChart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(loadChart, 50, 105);
    lv_obj_set_size(loadChart, 265, 150);
    lv_obj_set_style_size(loadChart, 2, LV_PART_INDICATOR);
    lv_chart_set_type(loadChart, LV_CHART_TYPE_LINE);
    lv_chart_set_update_mode(loadChart, LV_CHART_UPDATE_MODE_CIRCULAR);
    load_ser = lv_chart_add_series(loadChart, lv_palette_main(LV_PALETTE_RED), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_set_range(loadChart, LV_CHART_AXIS_PRIMARY_Y, 980,1100);
    lv_chart_set_axis_tick(loadChart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 2, true, 50);
    lv_chart_set_point_count(loadChart, 800);

