jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
     // Create spam acc label
    auto span_acc_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(span_acc_label, 5, 280);
    lv_obj_set_style_text_color(span_acc_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(span_acc_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(span_acc_label, &lv_font_montserrat_14, LV_STATE_DEFAULT);
    lv_label_set_text(span_acc_label,"acc (mV): ");

    // Create BOX to acc value
    auto back_box_acc = lv_obj_create(lv_scr_act());
    lv_obj_add_style(back_box_acc, &style_shadow, 0);
    lv_obj_set_pos(back_box_acc, 95, 270);
    lv_obj_set_size(back_box_acc, 110, 30);

    label_box_pos = lv_label_create(lv_scr_act());
    lv_obj_set_pos(label_box_pos, 100, 273);
    lv_obj_set_style_text_color(label_box_pos, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(label_box_pos, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(label_box_pos, &lv_font_montserrat_22, LV_STATE_DEFAULT);
    lv_label_set_text(label_box_pos,"--");

    // ***************** Create chart pos *****************
    posChart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(posChart, 50, 305);
    lv_obj_set_size(posChart, 265, 150);
    lv_obj_set_style_size(posChart, 2, LV_PART_INDICATOR);
    lv_chart_set_type(posChart, LV_CHART_TYPE_LINE); /*Show lines and points too*/
    lv_chart_set_update_mode(posChart, LV_CHART_UPDATE_MODE_CIRCULAR);
    pos_ser = lv_chart_add_series(posChart, lv_palette_main(LV_PALETTE_BLUE), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_set_range(posChart, LV_CHART_AXIS_PRIMARY_Y, 2450, 2550);
    lv_chart_set_axis_tick(posChart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 2, true, 50);
    lv_chart_set_point_count(posChart, 800);

    if(acquire_mode){
        lv_timer_t *timer = lv_timer_create(add_data, 2, NULL);
        lv_timer_set_repeat_count(timer, read_n_max - 1);
    }else{
        timer = lv_timer_create(add_data_ESPNOW, 2, NULL);
        //lv_timer_set_repeat_count(timer, read_n_max + 3);
    }    
    
}

void AcquisitionScreen_0(int16_t numberData, int16_t numberDataFill)
{
    // Clear screen
    lv_obj_clean(lv_scr_act());

    // Create Header
    static lv_style_t style_shadow;
    auto Header = lv_obj_create(lv_scr_act());
    lv_obj_add_style(Header, &style_shadow, 0);
    lv_obj_set_pos(Header, 1, 1);
    lv_obj_set_size(Header, 318, 30);

    // Set label to WellName
    auto WellName_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(WellName_label, 7, 5);
    lv_obj_set_style_text_color(WellName_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(WellName_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(WellName_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_label_set_text(WellName_label, WellName.c_str());

    // Set label to DateTime
    auto DateTime_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(DateTime_label, 85, 5);
    lv_obj_set_style_text_color(DateTime_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(DateTime_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(DateTime_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_label_set_text(DateTime_label, dt.c_str());

    // ***************** Set label to Diagnosis *****************
    auto Diagnosis_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(Diagnosis_label, 10, 32);
    lv_obj_set_style_text_color(Diagnosis_label, lv_palette_main(LV_PALETTE_DEEP_ORANGE), LV_STATE_DEFAULT);
    lv_label_set_long_mode(Diagnosis_label, LV_LABEL_LONG_SCROLL_CIRCULAR); /*Circular scroll*/
    lv_obj_set_width(Diagnosis_label, 300);
    lv_obj_set_style_text_font(Diagnosis_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    String Label_diagnosis = "";
    if(status == "stopped"){
        Label_diagnosis = status;
    }else{
        for (int i = 0; i < 10; i++)
        {
            if(v_diagnosis[i] < 0.7){
                Label_diagnosis += label_diagnosis[i] + " - ";
            }
        }
    }
    
    lv_label_set_text(Diagnosis_label, Label_diagnosis.c_str());

    // ***************** Create dynachart *****************
    lv_obj_t *dynachart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(dynachart, 45, 65);
    lv_obj_set_size(dynachart, 180, 250);
    //lv_obj_set_style_size(dynachart, 2, LV_PART_INDICATOR);
    // lv_obj_add_event_cb(dynachart, draw_event_cb, LV_EVENT_DRAW_PART_BEGIN, NULL);
    lv_obj_set_style_line_width(dynachart, 3, LV_PART_ITEMS); /*Remove the lines*/

    lv_chart_set_type(dynachart, LV_CHART_TYPE_SCATTER);

    lv_chart_set_axis_tick(dynachart, LV_CHART_AXIS_PRIMARY_X, 10, 5, 5, 4, true, 30);
    lv_chart_set_axis_tick(dynachart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 5, true, 50);

    lv_chart_set_range(dynachart, LV_CHART_AXIS_PRIMARY_X, 0, 100);
    lv_chart_set_range(dynachart, LV_CHART_AXIS_PRIMARY_Y, -50, 1200);

    lv_chart_set_point_count(dynachart, numberData);

    lv_chart_series_t *ser = lv_chart_add_series(dynachart, lv_palette_main(LV_PALETTE_BROWN), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_series_t *ser1 = lv_chart_add_series(dynachart, lv_palette_main(LV_PALETTE_GREEN), LV_CHART_AXIS_SECONDARY_Y);

    /**/
    for (uint32_t i = 0; i < numberData; i++)
    {
        lv_chart_set_next_value2(dynachart, ser, pp[i] * 100, a0[i] * 200);
        //lv_chart_set_next_value2(dynachart, ser1, pos_surf[i] * 10, load_surf[i] * 100);
        //lv_chart_set_next_value2(dynachart, ser, pp[i] * 420, a0[i] * 500);
        lv_chart_set_next_value2(dynachart, ser1, pp[i] * 100, load.get(i) * 10);
    }

    // ***************** run time text *****************
    lv_obj_t *box_runTime = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_runTime, true);
    lv_textarea_set_password_mode(box_runTime, false);
    lv_obj_set_pos(box_runTime, 230, 50);
    lv_obj_set_size(box_runTime, 85, 43);

    auto label_rt_fill = lv_label_create(box_runTime);
    lv_label_set_text(label_rt_fill, String(runTime,2).c_str());

    lv_obj_center(label_rt_fill);
    lv_obj_set_style_text_font(label_rt_fill, &lv_font_montserrat_22, LV_STATE_DEFAULT);

