jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
    }

    lv_label_set_text(Diagnosis_label, Label_diagnosis.c_str());
    lv_label_set_text(Diagnosis_label, "servoil");

    // ***************** Create dynachart *****************
    lv_obj_t *dynachart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(dynachart, 45, 65);
    lv_obj_set_size(dynachart, 180, 250);
    // lv_obj_add_event_cb(dynachart, draw_event_cb, LV_EVENT_DRAW_PART_BEGIN, NULL);
    lv_obj_set_style_line_width(dynachart, 1, LV_PART_ITEMS); /*Remove the lines*/

    lv_chart_set_type(dynachart, LV_CHART_TYPE_SCATTER);

    lv_chart_set_axis_tick(dynachart, LV_CHART_AXIS_PRIMARY_X, 10, 5, 5, 4, true, 30);
    lv_chart_set_axis_tick(dynachart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 5, true, 50);

    lv_chart_set_range(dynachart, LV_CHART_AXIS_PRIMARY_X, 0, 100);
    lv_chart_set_range(dynachart, LV_CHART_AXIS_PRIMARY_Y, -50, 650);

    lv_chart_set_point_count(dynachart, numberData);

    lv_chart_series_t *ser = lv_chart_add_series(dynachart, lv_palette_main(LV_PALETTE_BROWN), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_series_t *ser1 = lv_chart_add_series(dynachart, lv_palette_main(LV_PALETTE_GREEN), LV_CHART_AXIS_SECONDARY_Y);

    /**/
    for (uint32_t i = 0; i < numberData; i++)
    {
        //lv_chart_set_next_value2(dynachart, ser, pp[i] * 420, a0[i] * 500);
        lv_chart_set_next_value2(dynachart, ser, pp[i] * 100, load.get(i) * 100);
        //lv_chart_set_next_value2(dynachart, ser1, pp[i] * 100, a0[i] * 100);
    }

    // ***************** Create fill text *****************
    lv_obj_t *box_fill = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_fill, true);
    lv_textarea_set_password_mode(box_fill, false);
    lv_obj_set_pos(box_fill, 230, 75);
    lv_obj_set_size(box_fill, 85, 45);

    auto label_box_fill = lv_label_create(box_fill);

    //char payloadFill[20];
    //FillPump.toCharArray(payloadFill, (FillPump.length() + 1));
    lv_label_set_text(label_box_fill, String(fill,2).c_str());

    lv_obj_center(label_box_fill);
    lv_obj_set_style_text_font(label_box_fill, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *fill_label = lv_label_create(lv_scr_act());
    lv_label_set_text(fill_label, "Fill (%):");
    lv_obj_align_to(fill_label, box_fill, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create SPM text *****************
    lv_obj_t *box_SPM = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_SPM, true);
    lv_textarea_set_password_mode(box_SPM, false);
    lv_obj_set_pos(box_SPM, 230, 150);
    lv_obj_set_size(box_SPM, 85, 45);

    auto label_box_SPM = lv_label_create(box_SPM);

    //char payloadSPM[20];
    //SPM.toCharArray(payloadSPM, (SPM.length() + 1));
    lv_label_set_text(label_box_SPM, SPM.c_str());
    lv_obj_center(label_box_SPM);
    lv_obj_set_style_text_font(label_box_SPM, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *SPM_label = lv_label_create(lv_scr_act());
    lv_label_set_text(SPM_label, "SPM (Hz):");
    lv_obj_align_to(SPM_label, box_SPM, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create PEAK LOAD *****************
    lv_obj_t *box_peak = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_peak, true);
    lv_textarea_set_password_mode(box_peak, false);
    lv_obj_set_pos(box_peak, 230, 225);
    lv_obj_set_size(box_peak, 85, 45);

    auto label_box_peak = lv_label_create(box_peak);

    //char payloadPeak[20];
    //PeakLoad.toCharArray(payloadPeak, (PeakLoad.length() + 1));
    lv_label_set_text(label_box_peak, PeakLoad.c_str());
    lv_obj_center(label_box_peak);
    lv_obj_set_style_text_font(label_box_peak, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *Peak_label = lv_label_create(lv_scr_act());
    lv_label_set_text(Peak_label, "Peak (KLb):");
    lv_obj_align_to(Peak_label, box_peak, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create MIN LOAD *****************
    lv_obj_t *box_min = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_min, true);
    lv_textarea_set_password_mode(box_min, false);
    lv_obj_set_pos(box_min, 230, 300);
    lv_obj_set_size(box_min, 85, 45);

    auto label_box_min = lv_label_create(box_min);

    lv_label_set_text(label_box_min, MinLoad.c_str());
    lv_obj_center(label_box_min);
    lv_obj_set_style_text_font(label_box_min, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *Min_label = lv_label_create(lv_scr_act());
    lv_label_set_text(Min_label, "Min (KLb):");
    lv_obj_align_to(Min_label, box_min, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create fillpump plot *****************
    lv_obj_t *fillchart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(fillchart, 45, 370);
    lv_obj_set_size(fillchart, 270, 80);
    // lv_obj_add_event_cb(fillchart, draw_event_cb, LV_EVENT_DRAW_PART_BEGIN, NULL);
    lv_obj_set_style_line_width(fillchart, 1, LV_PART_ITEMS); /*Remove the lines*/
    lv_obj_set_style_size(fillchart, 2, LV_PART_INDICATOR);

    lv_chart_set_type(fillchart, LV_CHART_TYPE_SCATTER);
    // lv_chart_set_update_mode(fillchart,LV_CHART_UPDATE_MODE_CIRCULAR);
    // lv_chart_set_range(fillchart, LV_CHART_AXIS_PRIMARY_Y, 0, 100);
    // lv_chart_set_point_count(fillchart, 250);

    lv_chart_set_axis_tick(fillchart, LV_CHART_AXIS_PRIMARY_X, 5, 5, 7, 5, true, 30);
    lv_chart_set_axis_tick(fillchart, LV_CHART_AXIS_PRIMARY_Y, 2, 1, 2, 2, true, 10);

    lv_chart_set_range(fillchart, LV_CHART_AXIS_PRIMARY_X, 0, 240);
    lv_chart_set_range(fillchart, LV_CHART_AXIS_PRIMARY_Y, 0, 100);

    lv_chart_set_point_count(fillchart, 250);

    lv_chart_series_t *ser2 = lv_chart_add_series(fillchart, lv_palette_main(LV_PALETTE_BROWN), LV_CHART_AXIS_PRIMARY_Y);

    // lv_chart_set_next_value(posChart, pos_ser, pos_raw[cnt]*10);
    /*
    for (uint32_t i = 1; i < numberDataFill; i++)
    {
        lv_chart_set_next_value2(fillchart, ser2, dtFillPumpList[i] * 10, FillPumpList[i]);
    }
    */

    // Set label tittle plot
    auto plot_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(plot_label, 10, 350);
    lv_obj_set_style_text_color(plot_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(plot_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(plot_label, &lv_font_montserrat_14, LV_STATE_DEFAULT);
    lv_label_set_text(plot_label, "Fill pump for this day");
}

