jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
/* ********************** ESP_NOW CALLBACK *********************** */
void OnDataRecv(const uint8_t * mac, const uint8_t *incomingData, int len) {
    char* buff = (char*) incomingData;        //char buffer
    String jsondata = String(buff);           //converting into STRING
    //Serial.println(jsondata);
    appendFile(SD, "/data.txt", jsondata.c_str());
    
    StaticJsonDocument<96> docEN;
    DeserializationError error = deserializeJson(docEN, jsondata);
    
    if (!error) {
        flag = docEN["f"];
        if(flag == 0){ // flag start acquire data
            const char* tmp_dt = docEN["dt"];
            dt = String(tmp_dt);
            //lv_timer_reset(timer);

        }else if(flag == 1){ // flag acquire data //tmp_n = docEN["n"];
            tmp_acc = docEN["a"];
            tmp_load = docEN["l"];
            //lv_timer_handler();
        }else if(flag == 2){ // flag end acquire data
            //dataProcess();
        }
        lv_timer_handler();
    }

    else {
        //Serial.print(F("deserializeJson() failed: "));  //Just in case of an ERROR of ArduinoJSon
        //Serial.println(error.f_str());
        return;
    }
    
}

/* ********************** WIRE RECEIVER MAIN *********************** */
void wireReceiver(String t_dt){
    ADS.begin();
    f = ADS.toVoltage(1) * 100;
    ADS.setDataRate(5);

    pcf8574.digitalWrite(P3, HIGH);
    delay(4000);

    //AcquisitionScreen();
    //smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 255, .red = 0}}));

    start_time = millis();
    for (uint32_t i = 0; i < read_n_max; i++)
    {
        lv_timer_handler();
        delay(25);
    }
    
    end_time = millis() - start_time;

    pcf8574.digitalWrite(P3, LOW);

    dataProcess();
    saveSendDate(t_dt);
    
}

/* ********************** ESP NOW RECEIVER MAIN*********************** */
void espNowReceiver(){
    WiFi.mode(WIFI_STA);
    if (esp_now_init() != ESP_OK) {       //Init ESPNOW
        Serial.println("Error initializing ESP-NOW");
        return;
    }

    esp_now_register_recv_cb(OnDataRecv);

}

/* ************************************************************************************************ */
/* ******************************************** SETUP ********************************************* */
/* ************************************************************************************************ */

void setup()
{
    //Serial.begin(115200);
    //Serial.println(WiFi.macAddress());
    
    pcf8574.pinMode(P0, INPUT); // transmision mode
    pcf8574.pinMode(P1, INPUT); // adquisition mode
    pcf8574.pinMode(P2, OUTPUT); // reset sim800
    pcf8574.pinMode(P3, OUTPUT); // CC1 available

    /* ------- get date time from rtc ------- */
    Wire.begin();
    delay(1000);
    DateTime now = myRTC.now();
    char new_DT[25];
    sprintf(new_DT, "%04d/%02d/%02d %02d:%02d:%02d", now.year(), now.month(), now.day(), now.hour(), now.minute(), now.second());
    dt = String(new_DT);
    //Serial.println("Hora y Fecha: " + dt);

    /* ------- create file path ------- */
    char new_filePath[18];
    sprintf(new_filePath, "/data_%04d_%02d_%02d.txt", now.year(), now.month(), now.day());
    //Serial.println(String(new_filePath));

    String t_dt = String(new_filePath);

    if(!SD.begin(5)){
        //smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 255, .green = 255, .red = 255}}));
        return;
    }

    delay(50);

    readFile(SD, t_dt.c_str());

    ++bootCount;
    esp_sleep_enable_timer_wakeup(TIME_TO_SLEEP * uS_TO_S_FACTOR);

    if (pcf8574.begin()){
		//Serial.println("OK");
	}else{
		//Serial.println("I2C io expander error.");
	}

    delay(50);

    acquire_mode = pcf8574.digitalRead(P1);
    delay(50);
    transmission_mode = pcf8574.digitalRead(P0);

    if (transmission_mode)
    {
        pcf8574.digitalWrite(P2, HIGH);
        delay(1000);
        modem.sleepEnable(true);
        pcf8574.digitalWrite(P2, LOW);
    }

    smartdisplay_init();
    AcquisitionScreen(50,nRecords);
    lv_timer_handler();

    if(acquire_mode){
        //Serial.println("CC1 MODE");
        smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 100, .green = 0, .red = 0}}));

        wireReceiver(t_dt);

    }else{
        //Serial.println("CC3 MODE - ESP NOW");
        smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 100, .green = 100, .red = 0}}));
        espNowReceiver();
    }

    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 0}}));
}

void loop2()
{
    if (Serial.available() > 0)
    {
        String jsondata = Serial.readString();

        StaticJsonDocument<96> docEN;
        DeserializationError error = deserializeJson(docEN, jsondata);

        if (!error)
        {
            flag = docEN["f"];
            if (flag == 0)
            { // flag start acquire data
                const char *tmp_dt = docEN["dt"];
                dt = String(tmp_dt);
                // lv_timer_reset(timer);
            }
            else if (flag == 1)
            { // flag acquire data //tmp_n = docEN["n"];
                tmp_acc = docEN["a"];
                tmp_load = docEN["l"];
                // lv_timer_handler();
            }
            else if (flag == 2)
            { // flag end acquire data
                // dataProcess();
            }
            lv_timer_handler();
        }
    }
}

void loop()
{
    //while (!Serial.available()); // Wait for input
    //String name = Serial.readStringUntil('\n');
    /*
    if (Serial.available() > 0)
    {
        String jsondata = Serial.readStringUntil('\n');

        StaticJsonDocument<96> docEN;
        DeserializationError error = deserializeJson(docEN, jsondata);

        if (!error)
        {
            flag = docEN["f"];
            if (flag == 0)
            { // flag start acquire data
                const char *tmp_dt = docEN["dt"];
                dt = String(tmp_dt);
                // lv_timer_reset(timer);
            }
            else if (flag == 1)
            { // flag acquire data //tmp_n = docEN["n"];
                tmp_acc = docEN["a"];
                tmp_load = docEN["l"];
                // lv_timer_handler();
            }
            else if (flag == 2)
            { // flag end acquire data
                // dataProcess();
            }
            lv_timer_handler();
        }
    }*/
}
    /*
    if(mode == 1){
        if (!mqtt.connected())
        {
            reconnect();
        }

        mqtt.loop();
    }
    */
    
    //delay(10);

    //unsigned long currentMillis = millis();



    /*
    
    if(currentMillis - previousMillis > 120000) {
        digitalWrite(pinCC1W,LOW);
        gpio_hold_en(GPIO_NUM_1);180/24

        digitalWrite(17,LOW);
        gpio_hold_en(GPIO_NUM_17);

        digitalWrite(4,LOW);
        gpio_hold_en(GPIO_NUM_4);

        digitalWrite(16,LOW);
        gpio_hold_en(GPIO_NUM_16);

        gpio_deep_sleep_hold_en();
        esp_deep_sleep_start();
        previousMillis = currentMillis; 
    }
    */
